#ifndef MONSTER_TEST_READER_H
#define MONSTER_TEST_READER_H

/* Generated by flatcc 0.6.2 FlatBuffers schema compiler for C by dvide.com */

#ifndef FLATBUFFERS_COMMON_READER_H
#include "flatbuffers_common_reader.h"
#endif
#ifndef INCLUDE_TEST1_READER_H
#include "include_test1_reader.h"
#endif
#ifndef ATTRIBUTES_READER_H
#include "attributes_reader.h"
#endif
#include "flatcc/flatcc_flatbuffers.h"
#ifndef __alignas_is_defined
#include <stdalign.h>
#endif
#include "flatcc/flatcc_prologue.h"
#undef flatbuffers_identifier
#define flatbuffers_identifier "MONS"
#undef flatbuffers_extension
#define flatbuffers_extension "mon"

typedef struct InGlobalNamespace InGlobalNamespace_t;
typedef const InGlobalNamespace_t *InGlobalNamespace_struct_t;
typedef InGlobalNamespace_t *InGlobalNamespace_mutable_struct_t;
typedef const InGlobalNamespace_t *InGlobalNamespace_vec_t;
typedef InGlobalNamespace_t *InGlobalNamespace_mutable_vec_t;
typedef struct MyGame_Example_Test MyGame_Example_Test_t;
typedef const MyGame_Example_Test_t *MyGame_Example_Test_struct_t;
typedef MyGame_Example_Test_t *MyGame_Example_Test_mutable_struct_t;
typedef const MyGame_Example_Test_t *MyGame_Example_Test_vec_t;
typedef MyGame_Example_Test_t *MyGame_Example_Test_mutable_vec_t;
typedef struct MyGame_Example_Vec3 MyGame_Example_Vec3_t;
typedef const MyGame_Example_Vec3_t *MyGame_Example_Vec3_struct_t;
typedef MyGame_Example_Vec3_t *MyGame_Example_Vec3_mutable_struct_t;

    case MyGame_Example_Color_Green: return "Green";
    case MyGame_Example_Color_Blue: return "Blue";
    default: return "";
    }
}

static inline int MyGame_Example_Color_is_known_value(MyGame_Example_Color_enum_t value)
{
    switch (value) {
    case MyGame_Example_Color_Red: return 1;
    case MyGame_Example_Color_Green: return 1;
    case MyGame_Example_Color_Blue: return 1;
    default: return 0;
    }
}

typedef int32_t MyGame_Example_notemptyenum_enum_t;
__flatbuffers_define_integer_type(MyGame_Example_notemptyenum, MyGame_Example_notemptyenum_enum_t, 32)
#define MyGame_Example_notemptyenum_x ((MyGame_Example_notemptyenum_enum_t)INT32_C(0))

static inline const char *MyGame_Example_notemptyenum_name(MyGame_Example_notemptyenum_enum_t value)
{
    switch (value) {
    case MyGame_Example_notemptyenum_x: return "x";
    default: return "";
    }
}

static inline int MyGame_Example_notemptyenum_is_known_value(MyGame_Example_notemptyenum_enum_t value)
{
    switch (value) {
    case MyGame_Example_notemptyenum_x: return 1;
    default: return 0;
    }
}

typedef int32_t Fantasy_ReorderedEnum_enum_t;
__flatbuffers_define_integer_type(Fantasy_ReorderedEnum, Fantasy_ReorderedEnum_enum_t, 32)
#define Fantasy_ReorderedEnum_rx ((Fantasy_ReorderedEnum_enum_t)INT32_C(10))
#define Fantasy_ReorderedEnum_ry ((Fantasy_ReorderedEnum_enum_t)INT32_C(1))
#define Fantasy_ReorderedEnum_rz ((Fantasy_ReorderedEnum_enum_t)INT32_C(9))

static inline const char *Fantasy_ReorderedEnum_name(Fantasy_ReorderedEnum_enum_t value)
{
    switch (value) {
    case Fantasy_ReorderedEnum_rx: return "rx";
    case Fantasy_ReorderedEnum_ry: return "ry";
    case Fantasy_ReorderedEnum_rz: return "rz";
    default: return "";
    }
}

static inline int Fantasy_ReorderedEnum_is_known_value(Fantasy_ReorderedEnum_enum_t value)
{
    switch (value) {
    case Fantasy_ReorderedEnum_rx: return 1;
    case Fantasy_ReorderedEnum_ry: return 1;
    case Fantasy_ReorderedEnum_rz: return 1;
    default: return 0;
    }
}

typedef int8_t Fantasy_ReorderedColor_enum_t;
__flatbuffers_define_integer_type(Fantasy_ReorderedColor, Fantasy_ReorderedColor_enum_t, 8)
#define Fantasy_ReorderedColor_RBlue ((Fantasy_ReorderedColor_enum_t)INT8_C(8))
#define Fantasy_ReorderedColor_RRed ((Fantasy_ReorderedColor_enum_t)INT8_C(1))
#define Fantasy_ReorderedColor_RGreen ((Fantasy_ReorderedColor_enum_t)INT8_C(2))

static inline const char *Fantasy_ReorderedColor_name(Fantasy_ReorderedColor_enum_t value)
{
    switch (value) {
    case Fantasy_ReorderedColor_RBlue: return "RBlue";
    case Fantasy_ReorderedColor_RRed: return "RRed";
    case Fantasy_ReorderedColor_RGreen: return "RGreen";
    default: return "";
    }
}

static inline int Fantasy_ReorderedColor_is_known_value(Fantasy_ReorderedColor_enum_t value)
{
    switch (value) {
    case Fantasy_ReorderedColor_RBlue: return 1;
    case Fantasy_ReorderedColor_RRed: return 1;
    case Fantasy_ReorderedColor_RGreen: return 1;
    default: return 0;
    }
}


struct InGlobalNamespace {
    alignas(1) int8_t unused;
};
static_assert(sizeof(InGlobalNamespace_t) == 1, "struct size mismatch");

static inline const InGlobalNamespace_t *InGlobalNamespace__const_ptr_add(const InGlobalNamespace_t *p, size_t i) { return p + i; }
static inline InGlobalNamespace_t *InGlobalNamespace__ptr_add(InGlobalNamespace_t *p, size_t i) { return p + i; }
static inline InGlobalNamespace_struct_t InGlobalNamespace_vec_at(InGlobalNamespace_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t InGlobalNamespace__size(void) { return 1; }
static inline size_t InGlobalNamespace_vec_len(InGlobalNamespace_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(InGlobalNamespace)

__flatbuffers_define_struct_scalar_field(InGlobalNamespace, unused, flatbuffers_int8, int8_t)

struct MyGame_Example_Test {
    alignas(2) int16_t a;
    alignas(1) int8_t b;
};
static_assert(sizeof(MyGame_Example_Test_t) == 4, "struct size mismatch");

static inline const MyGame_Example_Test_t *MyGame_Example_Test__const_ptr_add(const MyGame_Example_Test_t *p, size_t i) { return p + i; }
static inline MyGame_Example_Test_t *MyGame_Example_Test__ptr_add(MyGame_Example_Test_t *p, size_t i) { return p + i; }
static inline MyGame_Example_Test_struct_t MyGame_Example_Test_vec_at(MyGame_Example_Test_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t MyGame_Example_Test__size(void) { return 4; }
static inline size_t MyGame_Example_Test_vec_len(MyGame_Example_Test_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(MyGame_Example_Test)

__flatbuffers_define_struct_scalar_field(MyGame_Example_Test, a, flatbuffers_int16, int16_t)
__flatbuffers_define_struct_scalar_field(MyGame_Example_Test, b, flatbuffers_int8, int8_t)

struct MyGame_Example_Vec3 {
    alignas(16) float x;
    alignas(4) float y;
    alignas(4) float z;
    alignas(8) double test1;
    alignas(1) MyGame_Example_Color_enum_t test2;
    alignas(2) MyGame_Example_Test_t test3;
};
static_assert(sizeof(MyGame_Example_Vec3_t) == 32, "struct size mismatch");

static inline const MyGame_Example_Vec3_t *MyGame_Example_Vec3__const_ptr_add(const MyGame_Example_Vec3_t *p, size_t i) { return p + i; }
static inline MyGame_Example_Vec3_t *MyGame_Example_Vec3__ptr_add(MyGame_Example_Vec3_t *p, size_t i) { return p + i; }
static inline MyGame_Example_Vec3_struct_t MyGame_Example_Vec3_vec_at(MyGame_Example_Vec3_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t MyGame_Example_Vec3__size(void) { return 32; }
static inline size_t MyGame_Example_Vec3_vec_len(MyGame_Example_Vec3_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(MyGame_Example_Vec3)

__flatbuffers_define_struct_scalar_field(MyGame_Example_Vec3, x, flatbuffers_float, float)
__flatbuffers_define_struct_scalar_field(MyGame_Example_Vec3, y, flatbuffers_float, float)
__flatbuffers_define_struct_scalar_field(MyGame_Example_Vec3, z, flatbuffers_float, float)
__flatbuffers_define_struct_scalar_field(MyGame_Example_Vec3, test1, flatbuffers_double, double)
__flatbuffers_define_struct_scalar_field(MyGame_Example_Vec3, test2, MyGame_Example_Color, MyGame_Example_Color_enum_t)
__flatbuffers_define_struct_struct_field(MyGame_Example_Vec3, test3, MyGame_Example_Test_struct_t)

struct MyGame_Example_Ability {
    alignas(4) uint32_t id;
    alignas(4) uint32_t distance;
};
static_assert(sizeof(MyGame_Example_Ability_t) == 8, "struct size mismatch");

static inline const MyGame_Example_Ability_t *MyGame_Example_Ability__const_ptr_add(const MyGame_Example_Ability_t *p, size_t i) { return p + i; }
static inline MyGame_Example_Ability_t *MyGame_Example_Ability__ptr_add(MyGame_Example_Ability_t *p, size_t i) { return p + i; }
static inline MyGame_Example_Ability_struct_t MyGame_Example_Ability_vec_at(MyGame_Example_Ability_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t MyGame_Example_Ability__size(void) { return 8; }
static inline size_t MyGame_Example_Ability_vec_len(MyGame_Example_Ability_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(MyGame_Example_Ability)

__flatbuffers_define_struct_scalar_field(MyGame_Example_Ability, id, flatbuffers_uint32, uint32_t)
/* Note: find only works on vectors sorted by this field. */
__flatbuffers_define_find_by_scalar_field(MyGame_Example_Ability, id, uint32_t)
__flatbuffers_define_struct_sort_by_scalar_field(MyGame_Example_Ability, id, uint32_t, MyGame_Example_Ability_t)
__flatbuffers_define_default_find_by_scalar_field(MyGame_Example_Ability, id, uint32_t)
__flatbuffers_define_default_scan_by_scalar_field(MyGame_Example_Ability, id, uint32_t)
#define MyGame_Example_Ability_vec_sort MyGame_Example_Ability_vec_sort_by_id
__flatbuffers_define_struct_scalar_field(MyGame_Example_Ability, distance, flatbuffers_uint32, uint32_t)

struct MyGame_Example_FooBar {
    alignas(4) float foo[16];
    alignas(4) int32_t bar[10];
    alignas(1) MyGame_Example_Color_enum_t col[3];
    alignas(2) MyGame_Example_Test_t tests[2];
    alignas(1) char text[5];
};
static_assert(sizeof(MyGame_Example_FooBar_t) == 124, "struct size mismatch");

static inline const MyGame_Example_FooBar_t *MyGame_Example_FooBar__const_ptr_add(const MyGame_Example_FooBar_t *p, size_t i) { return p + i; }
static inline MyGame_Example_FooBar_t *MyGame_Example_FooBar__ptr_add(MyGame_Example_FooBar_t *p, size_t i) { return p + i; }
static inline MyGame_Example_FooBar_struct_t MyGame_Example_FooBar_vec_at(MyGame_Example_FooBar_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t MyGame_Example_FooBar__size(void) { return 124; }
static inline size_t MyGame_Example_FooBar_vec_len(MyGame_Example_FooBar_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(MyGame_Example_FooBar)

__flatbuffers_define_struct_scalar_fixed_array_field(MyGame_Example_FooBar, foo, flatbuffers_float, float, 16)
__flatbuffers_define_struct_scalar_fixed_array_field(MyGame_Example_FooBar, bar, flatbuffers_int32, int32_t, 10)
__flatbuffers_define_struct_scalar_fixed_array_field(MyGame_Example_FooBar, col, MyGame_Example_Color, MyGame_Example_Color_enum_t, 3)
__flatbuffers_define_struct_struct_fixed_array_field(MyGame_Example_FooBar, tests, MyGame_Example_Test_struct_t, 2)
__flatbuffers_define_struct_scalar_fixed_array_field(MyGame_Example_FooBar, text, flatbuffers_char, char, 5)

struct Fantasy_Rapunzel {
    alignas(4) uint16_t hair_length;
    alignas(4) uint8_t __deprecated0[4]; /* was: 'travel_points' */
};
static_assert(sizeof(Fantasy_Rapunzel_t) == 8, "struct size mismatch");

static inline const Fantasy_Rapunzel_t *Fantasy_Rapunzel__const_ptr_add(const Fantasy_Rapunzel_t *p, size_t i) { return p + i; }
static inline Fantasy_Rapunzel_t *Fantasy_Rapunzel__ptr_add(Fantasy_Rapunzel_t *p, size_t i) { return p + i; }
static inline Fantasy_Rapunzel_struct_t Fantasy_Rapunzel_vec_at(Fantasy_Rapunzel_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Fantasy_Rapunzel__size(void) { return 8; }
static inline size_t Fantasy_Rapunzel_vec_len(Fantasy_Rapunzel_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Fantasy_Rapunzel)

__flatbuffers_define_struct_scalar_field(Fantasy_Rapunzel, hair_length, flatbuffers_uint16, uint16_t)
/* Note: find only works on vectors sorted by this field. */
__flatbuffers_define_find_by_scalar_field(Fantasy_Rapunzel, hair_length, uint16_t)
__flatbuffers_define_struct_sort_by_scalar_field(Fantasy_Rapunzel, hair_length, uint16_t, Fantasy_Rapunzel_t)
__flatbuffers_define_default_find_by_scalar_field(Fantasy_Rapunzel, hair_length, uint16_t)
__flatbuffers_define_default_scan_by_scalar_field(Fantasy_Rapunzel, hair_length, uint16_t)
#define Fantasy_Rapunzel_vec_sort Fantasy_Rapunzel_vec_sort_by_hair_length

struct Fantasy_BookReader {
    alignas(4) int32_t books_read;
};
static_assert(sizeof(Fantasy_BookReader_t) == 4, "struct size mismatch");

static inline const Fantasy_BookReader_t *Fantasy_BookReader__const_ptr_add(const Fantasy_BookReader_t *p, size_t i) { return p + i; }
static inline Fantasy_BookReader_t *Fantasy_BookReader__ptr_add(Fantasy_BookReader_t *p, size_t i) { return p + i; }
static inline Fantasy_BookReader_struct_t Fantasy_BookReader_vec_at(Fantasy_BookReader_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Fantasy_BookReader__size(void) { return 4; }
static inline size_t Fantasy_BookReader_vec_len(Fantasy_BookReader_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Fantasy_BookReader)

__flatbuffers_define_struct_scalar_field(Fantasy_BookReader, books_read, flatbuffers_int32, int32_t)


struct MyGame_InParentNamespace_table { uint8_t unused__; };

static inline size_t MyGame_InParentNamespace_vec_len(MyGame_InParentNamespace_vec_t vec)
__flatbuffers_vec_len(vec)
